projetoaline/app/controllers/alunos_controller.rb

	def index
		@aluno = Aluno.all
---
SELECT "alunos".* FROM "alunos"

	def edit
		@aluno = Aluno.find(params[:id])
---
SELECT  "alunos".* FROM "alunos"  WHERE "alunos"."id" = ? LIMIT 1  [["id", 6]]

	def create
		@aluno = Aluno.new(params.require(:aluno).permit(:nome, :matricula, :dataDeNascimento, :email, :senha))

		session[:token] = Digest::SHA1.hexdigest([Time.now, rand].join)

		email = AlunosMailer.cadastrado(@aluno,session[:token])
		email.deliver
		@aluno.save
---
INSERT INTO "alunos" ("created_at", "email", "matricula", "nome", "senha", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2014-09-26 02:36:26.007402"], ["email", ""], ["matricula", ""], ["nome", ""], ["senha", ""], ["updated_at", "2014-09-26 02:36:26.007402"]]

	def update
		@aluno = Aluno.find(params[:id])
		@aluno.update(params.require(:aluno).permit(:nome, :matricula, :dataDeNascimento, :email, :senha))
---
SELECT  "alunos".* FROM "alunos"  WHERE "alunos"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "alunos" SET "email" = ?, "updated_at" = ? WHERE "alunos"."id" = 5  [["email", "jamillejami19@gmail.com"], ["updated_at", "2014-10-16 18:10:50.247063"]]

	def show
		@aluno = Aluno.find(params[:id])
---
SELECT  "alunos".* FROM "alunos"  WHERE "alunos"."id" = ? LIMIT 1  [["id", 5]]

	def destroy
		a = Aluno.find(params[:id])
		a.destroy
---
SELECT  "alunos".* FROM "alunos"  WHERE "alunos"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "alunos" WHERE "alunos"."id" = ?  [["id", 1]]