projetoaline/app/controllers/disciplinas_controller.rb

	def index
		@disciplinas = Disciplina.all
---
SELECT "disciplinas".* FROM "disciplinas"

	def create
		@novaDisciplina = Disciplina.new(params.require(:disciplina).permit(:codigoDisciplina, :descricaoDisciplina))
		#@novaDisciplina.codigoDisciplina =
		#@novaDisciplina.descricaoDisciplina =
		@novaDisciplina.save
---
INSERT INTO "disciplinas" ("codigoDisciplina", "created_at", "descricaoDisciplina", "updated_at") VALUES (?, ?, ?, ?)  [["codigoDisciplina", "444"], ["created_at", "2014-09-26 14:36:51.337188"], ["descricaoDisciplina", "ddas"], ["updated_at", "2014-09-26 14:36:51.337188"]]