projetoaline/app/controllers/login_controller.rb

  def login
    #O digest tem que ser feito e verificado com outro digest
  	logado = Aluno.find_by_nome_and_senha(params[:usuario], Digest::MD5.hexdigest(params[:senha]))
---
SELECT  "alunos".* FROM "alunos"  WHERE "alunos"."nome" = 'jamille' AND "alunos"."senha" = 'a2e63ee01401aaeca78be023dfbb8c59' LIMIT 1