projetoaline/app/controllers/login_controller.rb

SELECT  "alunos".* FROM "alunos"  WHERE "alunos"."matricula" = 'teste' AND "alunos"."senha" = 'oioi' LIMIT 1
---
  def login
  	logado = Aluno.find_by_matricula_and_senha(params[:usuario], params[:senha])